# vim: set syntax=ruby:
#brew 'mas'
cask_args appdir: '/Applications'


# BASE SYSTEM
# ===========

# SHELLS
brew 'dash'
brew 'bash'
brew 'fish'

# CORE TOOLS
brew 'coreutils'
brew 'findutils'
brew 'moreutils'
brew 'binutils'
brew 'gnu-time'
brew 'gcore'
brew 'gawk'
brew 'grep'
brew 'make'
brew 'git'

# NETWORKING
brew 'curl'
brew 'wget'
brew 'nmap'
brew 'tcpdump'
brew 'unbound'
brew 'dnsmasq'
brew 'vegeta'
brew 'caddy'
brew 'wireguard-tools'
cask 'wireshark'

# ESSENTIALS
brew 'ripgrep'
brew 'xsv'
brew 'jq'
brew 'fd'
brew 'fzf'
brew 'bat'
brew 'exa'
brew 'broot'  # SHELL . /Users/luizberti/Library/Pref*/*.broot/launcher/bash/br
brew 'entr'
brew 'zstd'
brew 'lz4'
brew 'lzo'
brew 'htop'
brew 'minisign'
brew 'signify-osx'
brew 'tarsnap'
brew 'tig'
brew 'wabt'
brew 'sqlite'

# EXTRA UTILS
brew 'pdfgrep'
brew 'pandoc'
brew 'imagemagick'
brew 'ffmpeg'
brew 'buku'
brew 'jrnl'


# DEVELOPMENT
# ===========

# LANGUAGES
brew 'gcc'
brew 'lua'
brew 'luajit'
brew 'python'
brew 'elixir'
brew 'minimal-racket'  # POST raco pkg install --auto drracket
brew 'rustup-init'     # POST rustup update && rustup toolchain install stable
brew 'go'
cask 'julia'
cask 'adoptopenjdk'
brew 'clojure'
mas  'Haskell', id: 841285201 

# DEVELOPMENT
cask 'gitup'
cask 'kitty'
cask 'docker'
cask 'visual-studio-code'
cask 'ghidra'
cask 'cutter'
brew 'afl-fuzz'
brew 'qemu'
brew 'neovim'  # TODO maybe emacs?
brew 'rs/tap/curlie'
brew 'github/gh/gh'
brew 'awscli'
cask 'google-cloud-sdk'
brew 'terraform'
brew 'kubernetes-cli'
brew 'helm'


# DESKTOP APPS
# ============

cask 'firefox'
cask 'google-chrome'
cask 'transmission'
cask 'spotify'
cask 'vlc'
cask 'obs'
cask 'alfred'
cask 'rectangle'
cask 'appcleaner'
cask 'balenaetcher'
mas  'The Unarchiver', id: 425424353
mas  'WireGuard', id: 1451685025

mas  'Spark', id: 1176895641
mas  'Slack', id: 803453959
mas  'Telegram', id: 747648890
mas  'WhatsApp', id: 1147396723

mas  'Things3', id: 904280696
mas  'iA Writer', id: 775737590
mas  'Notability', id: 736189492
mas  '1Password 7', id: 1333542190
cask 'proxyman'
cask 'codekit'
cask 'dash'
cask 'blender'
cask 'sketch'
mas  'Pixelmator Pro', id: 1289583905

tap 'homebrew/cask-fonts'
cask 'font-fira-mono'
cask 'font-fira-code'

